Repository: UniversidadDelEste/pymotw
Catalog: locale/*/LC_MESSAGES/gettext/index.po
Languages: es_ar

source: gettext -- Message Catalogs
es_ar: gettext – Catálogos de mensajes

source: Message catalog API for internationalization.
es_ar: API para catálogo mensaje para internacionalización

source: 2.1.3 and later
es_ar: 2.1.3 y posterior

source: The :mod:`gettext` module provides a pure-Python implementation compatible with the `GNU gettext`_ library for message translation and catalog management. The tools available with the Python source distribution enable you to extract messages from your source, build a message catalog containing translations, and use that message catalog to print an appropriate message for the user at runtime.
es_ar: El módulo :mod:'gettext' proporciona una implementación en Python puro, compatible con la librería 'GNU gettext' para la traducción de mensajes y administración de catálogo. Las herramientas disponibles con la distribución de Python lo habilita para extraer mensajes desde su código, construir un catalogo de mensajes conteniendo las traducciones, y usar este catalogo de mensajes para imprimir el mensaje apropiado para el usuario cuando ejecuta su código.

source: Message catalogs can be used to provide internationalized interfaces for your program, showing messages in a language appropriate to the user. They can also be used for other message customizations, including "skinning" an interface for different wrappers or partners.
es_ar: Los catálogos de mensajes pueden ser usados para proveer interfaces internacionalizadas para su programa, mostrando mensajes en el lenguaje apropiado al usuario. También pueden ser usados para otras personalizaciones de mensajes, incluyendo "pieles" para interfaces para diferentes programas afiliados.

source: Although the standard library documentation says everything you need is included with Python, I found that ``pygettext.py`` refused to extract messages wrapped in the ``ungettext`` call, even when I used what seemed to be the appropriate command line options. I ended up installing the `GNU gettext`_ tools from source and using ``xgettext`` instead.
es_ar: Aunque la documentación de la biblioteca estándar dice todo lo que necesita está incluido en Python, me encontré con que pygettext.py se negó a extraer mensajes envueltos en la llamada de ungettext, aun cuando utilicé con lo que parecía ser las opciones de línea de comandos apropiados. Acabé instalando de las herramientas GNU gettext (http://www.gnu.org/software/gettext/) desde el repositorio y el usando de xgettext en su lugar.

source: Translation Workflow Overview
es_ar: Visión General del trabajo de traducción

source: The process for setting up and using translations includes five steps:
es_ar: El proceso para la creación y el uso de traducciones incluye cinco pasos:

source: Mark up literal strings in your code that contain messages to translate.
es_ar: Marcar cadenas literales en su código que contienen mensajes de traducir.

source: Start by identifying the messages within your program source that need to be translated, and marking the literal strings so the extraction program can find them.
es_ar: Comience por identificar los mensajes dentro de la fuente del programa que necesitan ser traducidos, y marcando las cadenas literales para que el programa de extracción pueda encontrarlos.

source: Extract the messages.
es_ar: Extraer los mensajes

source: After you have identified the translatable strings in your program source, use ``xgettext`` to pull the strings out and create a ``.pot`` file, or translation template. The template is a text file with copies of all of the strings you identified and placeholders for their translations.
es_ar: Después de haber identificado las cadenas traducibles en su fuente de programas, utilice xgettext para extraer las cadenas y crear un archivo .pot, o plantilla de traducción. La plantilla es un archivo de texto con las copias de todas las cadenas que ha identificado y marcadores de posición para sus traducciones.

source: Translate the messages.
es_ar: Traducir los mensajes

source: Give a copy of the ``.pot`` file to the translator, changing the extension to ``.po``. The ``.po`` file is an editable source file used as input for the compilation step. The translator should update the header text in the file and provide translations for all of the strings.
es_ar: Se pasa una copia del archivo ''.pot'' al traductor, cambiando la extensión a .po. El archivo .po es un archivo fuente editable utilizado como entrada para el paso de compilación. El traductor debe actualizar el texto del encabezado en el archivo y proporcionar traducciones de todas las cadenas.

source: "Compile" the message catalog from the translation.
es_ar: 4. "Compilar" el catálogo de mensajes de la traducción

source: When the translator gives you back the completed ``.po`` file, compile the text file to the binary catalog format using ``msgfmt``. The binary format is used by the runtime catalog lookup code.
es_ar: Cuando el traductor le devuelve el archivo .po completado, compilar el archivo de texto al formato de catálogo binario utilizando msgfmt. El formato binario es utilizado por el código de búsqueda de catálogo tiempo de ejecución.

source: Load and activate the appropriate message catalog at runtime.
es_ar: Cargar y activar el catálogo de mensajes apropiado en tiempo de ejecución

source: The final step is to add a few lines to your application to configure and load the message catalog and install the translation function. There are a couple of ways to do that, with associated trade-offs, and each is covered below.
es_ar: El paso final es agregar unas pocas líneas a su aplicación para configurar y cargar el catálogo de mensajes e instalar la función de traducción. Hay un par de maneras de hacer eso, con las compensaciones asociadas, y cada uno se cubre a continuación.

source: Let's go through those steps in a little more detail, starting with the modifications you need to make to your code.
es_ar: Vamos a través de los pasos con un poco más de detalle, a partir de las modificaciones que hay que hacer a su código.

source: Creating Message Catalogs from Source Code
es_ar: Creación de catálogos de mensajes desde el código fuente

source: :mod:`gettext` works by finding literal strings embedded in your program in a database of translations, and pulling out the appropriate translated string. There are several variations of the functions for accessing the catalog, depending on whether you are working with Unicode strings or not. The usual pattern is to bind the lookup function you want to use to the name ``_`` so that your code is not cluttered with lots of calls to functions with longer names.
es_ar: :mod:'gettext' funciona mediante la búsqueda de cadenas literales incorporados en su programa en una base de datos de traducciones, y extrayendo la cadena traducida apropiada. Existen diversas variaciones de las funciones de acceso al catálogo, dependiendo de si se está trabajando con cadenas Unicode o no. El patrón usual es obligar a la función de búsqueda que desea utilizar para el nombre ``_`` para que su código no esté lleno de un montón de llamadas a funciones con nombres más largos.

source: The message extraction program, ``xgettext``, looks for messages embedded in calls to the catalog lookup functions. It understands different source languages, and uses an appropriate parser for each. If you use aliases for the lookup functions or need to add extra functions, you can give ``xgettext`` the names of additional symbols to consider when extracting messages.
es_ar: El programa de extracción de mensajes, xgettext, busca mensajes incrustados en las llamadas a las funciones de búsqueda en el catálogo. Entiende diferentes idiomas de origen, y utiliza un programa de análisis apropiado para cada uno. Si utiliza los alias de las funciones de búsqueda o necesita añadir funciones adicionales, puede dar xgettext los nombres de los símbolos adicionales a tener en cuenta al extraer mensajes

source: Here's a simple script with a single message ready to be translated:
es_ar: Aquí hay un script sencillo con un solo mensaje listo para ser traducido:

source: In this case I am using the Unicode version of the lookup function, ``ugettext()``. The text ``"This message is in the script."`` is the message to be substituted from the catalog. I've enabled fallback mode, so if we run the script without a message catalog, the in-lined message is printed:
es_ar: En este caso estoy usando la versión Unicode de la función de búsqueda, ``ugettext()``. El texto ``"This message is in the script."`` es el mensaje a ser sustituido en el catálogo. He permitido modalidad de retorno, por lo que si se corre el script sin un catálogo de mensajes, el mensaje en línea se imprime:

source: The next step is to extract the message(s) and create the ``.pot`` file, using ``pygettext.py``.
es_ar: El siguiente paso es extraer el(los) mensaje (s) y crear el archivo .pot, utilizando pygettext.py.

source: The output file produced looks like:
es_ar: El archivo de salida producido se ve así:

source: Message catalogs are installed into directories organized by *domain* and *language*. The domain is usually a unique value like your application name. In this case, I used ``gettext_example``. The language value is provided by the user's environment at runtime, through one of the environment variables ``LANGUAGE``, ``LC_ALL``, ``LC_MESSAGES``, or ``LANG``, depending on their configuration and platform. My language is set to ``en_US`` so that's what I'll be using in all of the examples below.
es_ar: Catálogos de mensajes se instalan en directorios organizados por *dominio* y *lenguaje*. El dominio suele ser un valor único como el nombre de la aplicación. En este caso, he usado ``gettext_example``. El valor de idioma es proporcionada por el entorno del usuario en tiempo de ejecución, a través de una de las variables de entorno ``LANGUAGE``, ``LC_ALL``, ``LC_MESSAGES``, or ``LANG``, dependiendo de su configuración y de la plataforma. Mi lenguaje se establece en ``en_US`` así que eso es lo que voy a utilizar en todos los ejemplos de abajo.

source: Now that we have the template, the next step is to create the required directory structure and copy the template in to the right spot. I'm going to use the ``locale`` directory inside the PyMOTW source tree as the root of my message catalog directory, but you would typically want to use a directory accessible system-wide. The full path to the catalog input source is ``$localedir/$language/LC_MESSAGES/$domain.po``, and the actual catalog has the filename extension ``.mo``.
es_ar: Ahora que tenemos la plantilla, el siguiente paso es crear la estructura de directorios necesaria y copiar la plantilla en el lugar correcto. Voy a utilizar el directorio ``locale`` en el interior del árbol de fuentes PyMOTW como la raíz de mi directorio catálogo de mensajes, pero lo más habitual es que desee utilizar en todo el sistema un lugar de acceso. La ruta completa de la fuente de entrada de catálogo es de ``$localedir/$language/LC_MESSAGES/$domain.po``, y el catálogo actual tiene el .mo como extensión de archivo.

source: For my configuration, I need to copy ``gettext_example.pot`` to ``locale/en_US/LC_MESSAGES/gettext_example.po`` and edit it to change the values in the header and add my alternate messages. The result looks like:
es_ar: Para la configuración de mi, tengo que copiar ``gettext_example.pot`` a ``locale/en_US/LC_MESSAGES/gettext_example.po`` y editarlo para cambiar los valores en la cabecera y añadir mis mensajes alternativos. El resultado se ve así:

source: The catalog is built from the ``.po`` file using ``msgformat``:
es_ar: El catálogo se construye a partir del archivo ``.po`` usando ``msgformat``:

source: And now when we run the script, the message from the catalog is printed instead of the in-line string:
es_ar: Y ahora, cuando corremos el guion, el mensaje desde el catálogo se imprime en lugar de la cadena en línea:

source: Finding Message Catalogs at Runtime
es_ar: Encontrar catálogos de mensajes en tiempo de ejecución

source: As described above, the *locale directory* containing the message catalogs is organized based on the language with catalogs named for the *domain* of the program. Different operating systems define their own default value, but :mod:`gettext` does not know all of these defaults. Iut uses a default locale directory of ``sys.prefix + '/share/locale'``, but most of the time it is safer for you to always explicitly give a ``localedir`` value than to depend on this default being valid.
es_ar: Como se describió anteriormente, el *directorio locale* que contiene los catálogos de mensajes se organiza sobre la base de la lengua con catálogos nombre del *dominio* del programa. Los diferentes sistemas operativos definen su propio valor por defecto, pero :mod:`gettext`no sabe todos estos valores predeterminados. Iut utiliza un directorio regional predeterminada de ``sys.prefix + '/share/locale'``, pero la mayoría de las veces es más seguro para que usted pueda dar siempre explícitamente un valor ``localedir`` que depender de este valor predeterminado sea válido.

source: The language portion of the path is taken from one of several environment variables that can be used to configure localization features (``LANGUAGE``, ``LC_ALL``, ``LC_MESSAGES``, and ``LANG``). The first variable found to be set is used. Multiple languages can be selected by separating the values with a colon (``:``). We can illustrate how that works by creating a second message catalog and running a few experiments.
es_ar: La porción de la lengua de la ruta se ha tomado de una de las diversas variables de entorno que se pueden utilizar para configurar las funciones de localización (``LANGUAGE``, ``LC_ALL``, ``LC_MESSAGES``, and ``LANG``). Para establecer el idioma se utiliza la primer variable encontrada. Varios idiomas se pueden seleccionar mediante la separación de los valores con dos puntos (``:``). Podemos ilustrar cómo funciona mediante la creación de un segundo catálogo de mensajes y correr algunos experimentos.

source: Although ``find()`` shows the complete list of catalogs, only the first one in the sequence is actually loaded for message lookups.
es_ar: Aunque ``find()`` muestra la lista completa de los catálogos, sólo el primero de ellos en la secuencia es en realidad cargado para las búsquedas de mensajes.

source: Plural Values
es_ar: Valores plurales

source: While simple message substitution will handle most of your translation needs, :mod:`gettext` treats pluralization as a special case. Depending on the language, the difference between the singular and plural forms of a message may vary only by the ending of a single word, or the entire sentence structure may be different. There may also be `different forms depending on the level of plurality <http://www.gnu.org/software/gettext/manual/gettext.html#Plural-forms>`_. To make managing plurals easier (and possible), there is a separate set of functions for asking for the plural form of a message.
es_ar: Si bien la sustitución simple mensaje se encargará de la mayor parte de sus necesidades de traducción, mod: `gettext` trata a la pluralización como un caso especial. Dependiendo del idioma, la diferencia entre las formas singular y plural de un mensaje puede variar sólo por el fin de una sola palabra, o de toda la estructura de la oración puede ser diferente. También puede haber `formas diferentes, dependiendo del nivel de la pluralidad <http://www.gnu.org/software/gettext/manual/gettext.html#Plural-forms>` _. Para hacer más fácil la gestión de los plurales (y posible), hay un conjunto separado de funciones para pedir la forma plural de un mensaje.

source: Since there are alternate forms to be translated, the replacements are listed in an array. Using an array allows translations for languages with multiple plural forms (Polish, `for example <http://www.gnu.org/software/gettext/manual/gettext.html#Plural-forms>`_, has different forms indicating the relative quantity).
es_ar: Puesto que hay formas alternativas para ser traducidos, los reemplazos se enumeran en una matriz. El uso de una matriz permite traducciones de idiomas con múltiples formas plurales (polaco, `por ejemplo <http://www.gnu.org/software/gettext/manual/gettext.html#Plural-forms>` _, tiene diferentes formas que indican la cantidad relativa).

source: In addition to filling in the translation strings, you will also need to describe the way plurals are formed so the library knows how to index into the array for any given count value. The line ``"Plural-Forms: nplurals=INTEGER; plural=EXPRESSION;\n"`` includes two values to replace manually. ``nplurals`` is an integer indicating the size of the array (the number of translations used) and ``plural`` is a C language expression for converting the incoming quantity to an index in the array when looking up the translation. The literal string ``n`` is replaced with the quantity passed to ``ungettext()``.
es_ar: Además de rellenar las cadenas de traducción, usted también tendrá que describir la forma plurales que se forman por lo que la biblioteca sabe el índice en la matriz para cualquier valor de recuento dado. La línea `` "Plural-Forms: nplurals = INTEGER; EXPRESIÓN plural =; \ n" '' incluye dos valores para reemplazar manualmente. `` nplurals`` es un número entero que indica el tamaño de la matriz (el número de traducciones utiliza) y `` plural`` es una expresión del lenguaje C para la conversión de la cantidad de entrada de un índice de la matriz al buscar la traducción. La cadena literal `` n`` se sustituye por la cantidad que pase a `` ungettext () ``.

source: For example, English includes two plural forms. A quantity of ``0`` is treated as plural ("0 bananas"). The Plural-Forms entry should look like::
es_ar: Por ejemplo, Inglés incluye dos formas plurales. Una cantidad de `` 0`` se considere persona plural ("0 bananas"). La entrada plural debe ser similar ::

source: The singular translation would then go in position 0, and the plural translation in position 1.
es_ar: La traducción singular estaría en la posición 0, y la traducción al plural en la posición 1.

source: If we run the test script a few times after the catalog is compiled, you can see how different values of N are converted to indexes for the translation strings.
es_ar: Si ejecutamos el script de prueba un par de veces después de que se compiló el catálogo, se puede ver cómo los diferentes valores de N se convierten en índices de las cadenas de traducción.

source: Application vs. Module Localization
es_ar: Aplicación vs. Localización Módulo

source: The scope of your translation effort defines how you install and use the :mod:`gettext` functions in your code.
es_ar: El alcance de su esfuerzo de traducción define cómo instalar y utilizar las funciones de mod:`gettext` en el código.

source: Application Localization
es_ar: Localización de aplicaciones

source: For application-wide translations, it would be acceptable to install a function like ``ungettext()`` globally using the ``__builtins__`` namespace because you have control over the top-level of the application's code.
es_ar: Para traducciones de aplicación en todo, sería aceptable para instalar una función como `` ungettext () `` a nivel mundial utilizando el espacio de nombres de `` __builtins__`` porque usted tiene control sobre el nivel superior de código de la aplicación.

source: The ``install()`` function binds ``gettext()`` to the name ``_()`` in the ``__builtins__`` namespace. It also adds ``ngettext()`` and other functions listed in *names*. If *unicode* is true, the Unicode versions of the functions are used instead of the default ASCII versions.
es_ar: La función `` install () `` une `` gettext () `` para el nombre `` _ () `` en el `` espacio de nombres __builtins__``. También agrega `` ngettext () `` y otras funciones enumeradas en *names*. Si * Unicode * es verdadero, las versiones de Unicode de las funciones se utilizan en lugar de las versiones ASCII predeterminado.

source: Module Localization
es_ar: Localización Módulo

source: For a library, or individual module, modifying ``__builtins__`` is not a good idea because you don't know what conflicts you might introduce with an application global value. You can import or re-bind the names of translation functions by hand at the top of your module.
es_ar: Para una biblioteca o módulo individual, modificar `` __builtins__`` no es una buena idea porque no sabes lo que es posible introducir los conflictos con un valor global de la aplicación. Puede importar o volver a unir los nombres de las funciones de traducción con la mano en la parte superior de su módulo.

source: The standard library documentation for this module.
es_ar: La documentación de la biblioteca estándar para este módulo.

source: Other localization tools.
es_ar: Otras herramientas de localización.

source: The message catalog formats, API, etc. for this module are all based on the original gettext package from GNU. The catalog file formats are compatible, and the command line scripts have similar options (if not identical). The `GNU gettext manual <http://www.gnu.org/software/gettext/manual/gettext.html>`_ has a detailed description of the file formats and describes GNU versions of the tools for working with them.
es_ar: El Catálogo de formatos de mensaje, API, etc. para este módulo se basan en el paquete gettext original de GNU. Los formatos de archivo de catálogo son compatibles, y las secuencias de comandos de línea de comandos tienen opciones similares (si no idénticas). El manual de `GNU gettext <http://www.gnu.org/software/gettext/manual/gettext.html>` _ tiene una descripción detallada de los formatos de archivo y describe las versiones de GNU de las herramientas para trabajar con ellos.

source: `Internationalizing Python <http://www.python.org/workshops/1997-10/proceedings/loewis.html>`_
es_ar: `Internacionalización Python <http://www.python.org/workshops/1997-10/proceedings/loewis.html>` _

source: A paper by Martin von Löwis about techniques for internationalization of Python applications.
es_ar: Un artículo de Martin von Löwis acerca de las técnicas para la internacionalización de las aplicaciones de Python.

source: `Django Internationalization <http://docs.djangoproject.com/en/dev/topics/i18n/>`_
es_ar: `Django Internacionalización <http://docs.djangoproject.com/en/dev/topics/i18n/>` _

source: Another good source of information on using gettext, including real-life examples.
es_ar: Otra buena fuente de información sobre el uso de gettext, incluyendo ejemplos de la vida real.
