Repository: UniversidadDelEste/pymotw
Catalog: locale/*/LC_MESSAGES/argparse/index.po
Languages: es_ar

source: argparse -- Command line option and argument parsing.
es_ar: argparse -- Opción de línea de comandos y el argumento de análisis.

source: Command line option and argument parsing.
es_ar: Opción de línea de comandos y el argumento de análisis.

source: 2.7 and later
es_ar: 2.7 y posteriores

source: The :mod:`argparse` module was added to Python 2.7 as a replacement for :mod:`optparse`. The implementation of :mod:`argparse` supports features that would not have been easy to add to :mod:`optparse`, and that would have required backwards-incompatible API changes, so a new module was brought into the library instead. :mod:`optparse` is still supported, but is not likely to receive new features.
es_ar: El módulo :mod:`argparse` fue agregado a Python 2.7 como un reemplazo de :mod:`optparse`. La implementación de :mod:`argparse` soporta características que no habrían sido fáciles de agregar a :mod:`optparse`, y que habría requerido cambios hacia atrás en la API incompatibles, por lo que el nuevo módulo fue añadido a la biblioteca en su lugar. :mod:`optparse` sigue siendo soportado, pero es probable que no reciba nuevas características.

source: Comparing with optparse
es_ar: Comparando con optparse

source: The API for :mod:`argparse` is similar to the one provided by :mod:`optparse`, and in many cases :mod:`argparse` can be used as a straightforward replacement by updating the names of the classes and methods used. There are a few places where direct compatibility could not be preserved as new features were added, however.
es_ar: La API de :mod:`argparse` es similar a la proporcionada por :mod:`optparse`, y en muchos casos :mod:`argparse` se puede utilizar como un reemplazo directo mediante la actualización de los nombres de las clases y los métodos utilizados. Sin embargo, hay algunos lugares donde la compatibilidad directa no podía ser preservada como en las nuevas características.

source: You will have to decide whether to upgrade existing programs on a case-by-case basis. If you have written extra code to work around limitations of :mod:`optparse`, you may want to upgrade to reduce the amount of code you need to maintain. New programs should probably use argparse, if it is available on all deployment platforms.
es_ar: Usted tendrá que decidir si se debe actualizar los programas existentes en una base de caso por caso. Si usted ha escrito código extra para evitar limitaciones de: mod: `optparse`, es posible que desee actualizar a reducir la cantidad de código que necesita mantener.

source: Setting up a Parser
es_ar: La creación de un Analizador

source: The first step when using :mod:`argparse` is to create a parser object and tell it what arguments to expect. The parser can then be used to process the command line arguments when your program runs.
es_ar: El primer paso cuando se utiliza: mod: `argparse` es crear un objeto de programa de análisis y decirle qué argumentos esperar. El analizador se puede utilizar para procesar los argumentos de la línea de comandos cuando el programa se ejecuta.

source: The parser class is :class:`ArgumentParser`. The constructor takes several arguments to set up the description used in the help text for the program and other global behaviors or settings.
es_ar: La clase del analizador es :class: `ArgumentParser`. El constructor toma varios argumentos para establecer la descripción utilizada en el texto de ayuda para el programa y otros comportamientos o configuración global.

source: Defining Arguments
es_ar: Definiendo argumentos

source: :mod:`argparse` is a complete argument *processing* library. Arguments can trigger different actions, specified by the *action* argument to :func:`add_argument()`. Supported actions include storing the argument (singly, or as part of a list), storing a constant value when the argument is encountered (including special handling for true/false values for boolean switches), counting the number of times an argument is seen, and calling a callback.
es_ar: :mod:`argparse` es una librería completa de *procesado* de argumentos. Los argumentos pueden desencadenar diferentes acciones, especificada por el argumento *acción* de :func:`add_argument()`. Las acciones soportadas incluyen almacenar el argumento (individualmente, o como parte de una lista), almacenar un valor constante cuando se encuentra el argumento (incluyendo un tratamiento especial para los verdaderos valores / falso para interruptores booleanos), contando el número de veces que un argumento es visto, y llamando a una devolución de llamada.

source: The default action is to store the argument value. In this case, if a type is provided, the value is converted to that type before it is stored. If the *dest* argument is provided, the value is saved to an attribute of that name on the Namespace object returned when the command line arguments are parsed.
es_ar: La acción predeterminada es almacenar el valor del argumento. En este caso, si se proporciona un tipo, el valor se convierte a ese tipo antes de que se almacene. Si se proporciona el argumento *dest*, el valor se guarda en un atributo del mismo nombre en el objeto de espacio de nombres devueltos cuando se analizan los argumentos de la línea de comandos.

source: Parsing a Command Line
es_ar: Analizar una línea de comandos

source: Once all of the arguments are defined, you can parse the command line by passing a sequence of argument strings to :func:`parse_args()`. By default, the arguments are taken from ``sys.argv[1:]``, but you can also pass your own list. The options are processed using the GNU/POSIX syntax, so option and argument values can be mixed in the sequence.
es_ar: Una vez que todos los argumentos se definen, se puede analizar la línea de comandos mediante el paso de una secuencia de cadenas de argumentos a :func: `parse_args ()`. Por defecto, los argumentos son tomados de ``sys.argv [1:] '', pero también puede pasar su propia lista. Las opciones se procesan utilizando la sintaxis de GNU / POSIX, por lo que los valores de opción y los argumentos se pueden mezclar en la secuencia.

source: The return value from :func:`parse_args()` is a :class:`Namespace` containing the arguments to the command. The object holds the argument values as attributes, so if your argument ``dest`` is ``"myoption"``, you access the value as ``args.myoption``.
es_ar: El valor de retorno de :func: `parse_args ()` es un :class: `Namespace` que contiene los argumentos para el comando. El objeto contiene los valores de los argumentos como atributos, así que si su argumento ``dest`` es ``"myoption"``, se accede al valor como ``args.myoption``.

source: Simple Examples
es_ar: Ejemplos simples

source: Here is a simple example with 3 different options: a boolean option (``-a``), a simple string option (``-b``), and an integer option (``-c``).
es_ar: Aquí está un ejemplo sencillo con 3 opciones diferentes: una opción booleana (``-a``), una opción de cadena sencilla (``-b``), y una opción entero (``-c``).

source: There are a few ways to pass values to single character options. The example above uses two different forms, ``-bval`` and ``-c val``.
es_ar: Hay algunas maneras de pasar valores a las opciones de un solo carácter. El ejemplo anterior utiliza dos formas diferentes, ``-bval`` y ``-c val``.

source: The type of the value associated with ``'c'`` in the output is an integer, since the :class:`ArgumentParser` was told to convert the argument before storing it.
es_ar: El tipo de valor asociado con ``'c'`` en la salida es un entero, ya que la :class:`ArgumentParser` convirtió el argumento antes de guardarlo.

source: "Long" option names, with more than a single character in their name, are handled in the same way.
es_ar: Nombres de opción "largo", con más de un solo carácter en su nombre, se manejan de la misma manera.

source: And the results are similar:
es_ar: Y los resultados son similares:

source: One area in which :mod:`argparse` differs from :mod:`optparse` is the treatment of non-optional argument values. While :mod:`optparse` sticks to option parsing, :mod:`argparse` is a full command-line argument parser tool, and handles non-optional arguments as well.
es_ar: Un área en la que :mod: `argparse` difiere de :mod:` optparse` es el tratamiento de valores de argumento no opcional. Mientras :mod:`optparse` se pega a la opción de análisis, :mod:`argparse` es una herramienta completa de análisis de argumentos de línea de comandos, y maneja argumentos no opcionales también.

source: In this example, the "count" argument is an integer and the "units" argument is saved as a string. If either is not provided on the command line, or the value given cannot be converted to the right type, an error is reported.
es_ar: En este ejemplo, el argumento de "count" es un entero y el argumento de "units" se guarda como una cadena. Si bien no se proporciona en la línea de comandos, o el valor dado no se puede convertir al tipo correcto, se informa de un error.

source: Argument Actions
es_ar: Acciones de argumentos

source: There are six built-in actions that can be triggered when an argument is encountered:
es_ar: Hay seis acciones integradas que se pueden activar cuando se encuentra un argumento:

source: Save the value, after optionally converting it to a different type. This is the default action taken if none is specified expliclity.
es_ar: Guardar el valor, después de convertir opcionalmente a un tipo diferente. Esta es la acción por defecto toma si no se especifica de forma explícita.

source: Save a value defined as part of the argument specification, rather than a value that comes from the arguments being parsed. This is typically used to implement command line flags that aren't booleans.
es_ar: Guarda un valor definido como parte de la especificación de argumentos, en lugar de un valor que viene de los argumentos que se analizan. Esto normalmente se utiliza para implementar banderas de línea de comandos que no son booleanos.

source: Save the appropriate boolean value. These actions are used to implement boolean switches.
es_ar: Guarda el valor booleano apropiado. Estas acciones se utilizan para implementar interruptores booleanos.

source: Save the value to a list. Multiple values are saved if the argument is repeated.
es_ar: Guarda el valor de una lista. Varios valores se guardan si el argumento se repite.

source: Save a value defined in the argument specification to a list.
es_ar: Guarda un valor definido en la especificación de argumento para una lista.

source: Prints version details about the program and then exits.
es_ar: Prints versión detalles sobre el programa y luego se cierra.

source: Option Prefixes
es_ar: Los prefijos Opción

source: The default syntax for options is based on the Unix convention of signifying command line switches using a prefix of "-". :mod:`argparse` supports other prefixes, so you can make your program conform to the local platform default (i.e., use "/" on Windows) or follow a different convention.
es_ar: La sintaxis predeterminada para las opciones se basa en la convención de Unix de significar la línea de comandos utilizando un prefijo de "-". : mod: `argparse` soporta otros prefijos, por lo que puede hacer que su programa se ajuste a los valores de la plataforma local (es decir, el uso de" / "en Windows) o seguir una convención diferente.

source: Set the *prefix_chars* parameter for the :class:`ArgumentParser` to a string containing all of the characters that should be allowed to signify options. It is important to understand that although *prefix_chars* establishes the allowed switch characters, the individual argument definitions specify the syntax for a given switch. This gives you explicit control over whether options using different prefixes are aliases (such as might be the case for platform-independent command line syntax) or alternatives (e.g., using "``+``" to indicate turning a switch on and "``-``" to turn it off). In the example above, ``+a`` and ``-a`` are separate arguments, and ``//noarg`` can also be given as ``++noarg``, but not ``--noarg``.
es_ar: Ajuste el parámetro *prefix_chars* para :class:`ArgumentParser` a una cadena que contiene todos los caracteres que se debe permitir para significar opciones. Es importante entender que aunque *prefix_chars* establece los caracteres de conmutación permitidos, las definiciones de argumentos individuales especifican la sintaxis de un interruptor dado. Esto le da un control explícito sobre si las opciones que utilizan diferentes prefijos son alias (como podría ser el caso de la sintaxis de línea de comandos independiente de la plataforma) o alternativas (por ejemplo, utilizando "``+``" para indicar girar un interruptor de encendido y "``-``" para apagarlo). En el ejemplo anterior, ``+a`` y ``-a`` son argumentos separados, y ``//noarg`` también puede darse como ``++noarg``, pero no ``--noarg ``.

source: Sources of Arguments
es_ar: Fuentes de argumentos

source: In the examples so far, the list of arguments given to the parser have come from a list passed in explicitly, or were taken implicitly from :ref:`sys.argv <sys-argv>`. Passing the list explicitly is useful when you are using :mod:`argparse` to process command line-like instructions that do not come from the command line (such as in a configuration file).
es_ar: En los ejemplos hasta el momento, la lista de argumentos dados al analizador han venido de una lista aprobada en forma explícita o implícitamente se tomaron a partir de :ref:`sys.argv <sys-argv>`. Al pasar la lista de manera explícita es útil cuando se utiliza :mod:`argparse` para procesar instrucciones de línea de comandos como que no provienen de la línea de comandos (como en un archivo de configuración).

source: :mod:`shlex` makes it easy to split the string stored in the configuration file.
es_ar: :mod:`shlex` hace que sea fácil para dividir la cadena almacenada en el archivo de configuración.

source: An alternative to processing the configuration file yourself is to tell :mod:`argparse` how to recognize an argument that specifies an input file containing a set of arguments to be processed using *fromfile_prefix_chars*.
es_ar: Una alternativa para el procesamiento de la configuración del archivo es decirle usted mismo a :mod:`argparse` cómo reconocer un argumento que especifica un archivo de entrada que contiene un conjunto de argumentos para ser procesados utilizando *fromfile_prefix_chars*.

source: This example stops when it finds an argument prefixed with ``@``, then reads the named file to find more arguments. For example, an input file ``argparse_fromfile_prefix_chars.txt`` contains a series of arguments, one per line:
es_ar: En este ejemplo se detiene cuando encuentra un argumento con el prefijo ``@'', a continuación, lee el archivo llamado para encontrar más argumentos. Por ejemplo, un archivo de entrada ``argparse_fromfile_prefix_chars.txt`` contiene una serie de argumentos, uno por línea:

source: The output produced when processing the file is:
es_ar: La salida producida al procesar el archivo es:

source: Automatically Generated Options
es_ar: Opciones generados automáticamente

source: :mod:`argparse` will automatically add options to generate help and show the version information for your application, if configured to do so.
es_ar: :mod:`argparse` añadirá automáticamente las opciones para generar ayuda y mostrar la información de versión de la aplicación, si está configurado para hacerlo.

source: The *add_help* argument to :class:`ArgumentParser` controls the help-related options.
es_ar: El argumento *add_help* de :class:`ArgumentParser` controla las opciones de ayuda relacionados.

source: The help options (``-h`` and ``--help``) are added by default, but can be disabled by setting *add_help* to false.
es_ar: Las opciones de ayuda (``-h`` y ``--help``) se añaden por defecto, pero se puede desactivar configurando *add_help* como falso.

source: Although ``-h`` and ``--help`` are defacto standard option names for requesting help, some applications or uses of :mod:`argparse` either don't need to provide help or need to use those option names for other purposes.
es_ar: Aunque ``-h`` y ``--help`` son nombres de opción de facto para solicitar ayuda, algunas aplicaciones o usos de :mod:`argparse` o bien no necesitan proporcionar ayuda o necesitan utilizar esos nombres de opciones para otros fines.

source: The version options (``-v`` and ``--version``) are added when *version* is set in the :class:`ArgumentParser` constructor.
es_ar: Las opciones de versión (``-v`` y ` --version``) se añaden cuando *versión* se establece en el constructor de :class:`ArgumentParser` .

source: Both forms of the option print the program's version string, then cause it to exit immediately.
es_ar: Ambas formas de imprimen la versión del programa, y continuación salen del programa.

source: Parser Organization
es_ar: Organización Analizador

source: :mod:`argparse` includes several features for organizing your argument parsers, to make implementation easier or to improve the usability of the help output.
es_ar: :mod:`argparse` incluye varias características para organizar sus programas de análisis de argumentos, para hacer la aplicación más fácil o para mejorar la usabilidad de la salida de ayuda.

source: Sharing Parser Rules
es_ar: Compartiendo Reglas del analizador

source: It is common to need to implement a suite of command line programs that all take a set of arguments, and then specialize in some way. For example, if the programs all need to authenticate the user before taking any real action, they would all need to support ``--user`` and ``--password`` options. Rather than add the options explicitly to every :class:`ArgumentParser`, you can define a "parent" parser with the shared options, and then have the parsers for the individual programs inherit from its options.
es_ar: Es común poner en práctica que un conjunto de programas de línea de comandos tomen todos un conjunto de argumentos, y luego especializarse en alguna manera. Por ejemplo, si los programas de tienen la necesidad de autenticar al usuario antes de tomar cualquier acción real, tendrían todos la necesidad de soportar a las opciones ``--password`` y --user`` . En lugar de agregar las opciones de manera explícita a todas :class:`ArgumentParser`, puede definir un programa de análisis "padre"con las opciones comunes, y luego tener los programas de análisis de los programas individuales hereden sus opciones.

source: The first step is to set up the parser with the shared argument definitions. Since each subsequent user of the parent parser is going to try to add the same help options, causing an exception, we turn off automatic help generation in the base parser.
es_ar: El primer paso es configurar el analizador con las definiciones de argumentos compartidos. Dado que cada usuario posterior del analizador de los padres va a tratar de añadir las mismas opciones de ayuda, haciendo una excepción, apagamos la generación automática de ayuda en el programa de análisis de base.

source: Next, create another parser with *parents* set:
es_ar: A continuación, crear otro programa de análisis con los conjuntos *padres*:

source: And the resulting program takes all three options:
es_ar: Y el programa resultante tiene las tres opciones:

source: Conflicting Options
es_ar: Conflicto de opciones

source: The previous example pointed out that adding two argument handlers to a parser using the same argument name causes an exception. Change the conflict resolution behavior by passing a *conflict_handler*. The two built-in handlers are ``error`` (the default), and ``resolve``, which picks a handler based on the order they are added.
es_ar: El ejemplo anterior señaló que la adición de dos manejadores de argumentos a un programa de análisis utilizando el mismo nombre de argumento provoca una excepción. Cambiar el comportamiento de resolución de conflictos mediante el paso a *conflict_handler*. Los dos controladores incorporados son ``error`` (por defecto), y ``resolve``, que recoge un controlador basado en el orden en que se agregan.

source: Since the last handler with a given argument name is used, in this example the stand-alone option ``-b`` is masked by the alias for ``--long-b``.
es_ar: Desde el último controlador con un nombre argumento dado es utilizado, en este ejemplo la opción independiente ``-b`` está enmascarado por el alias de ``--long-b``.

source: Switching the order of the calls to :func:`add_argument` unmasks the stand-alone option:
es_ar: Cambiando el orden de las llamadas a :func:`add_argument` desenmascara la opción independiente:

source: Now both options can be used together.
es_ar: Ahora ambas opciones se pueden utilizar juntas.

source: Argument Groups
es_ar: Grupos de argumentos

source: :mod:`argparse` combines the argument definitions into "groups." By default, it uses two groups, with one for options and another for required position-based arguments.
es_ar: :mod:`argparse` combina las definiciones de argumentos en" grupos ". Por defecto, se utiliza dos grupos, uno para las opciones y otra para los argumentos basados en la posición deseada.

source: The grouping is reflected in the separate "positional arguments" and "optional arguments" section of the help output:
es_ar: La agrupación se refleja en los "argumentos posicionales" y "argumentos opcionales" separadas de la sección de salida de la ayuda:

source: You can adjust the grouping to make it more logical in the help, so that related options or values are documented together. The shared-option example from earlier could be written using custom grouping so that the authentication options are shown together in the help.
es_ar: Se puede ajustar la agrupación para que sea más lógico en la ayuda, por lo que las opciones o valores relacionados se documentan juntos. El ejemplo de la opción compartida podría escribirse usando agrupación personalizada para que las opciones de autenticación se muestren juntos en la ayuda.

source: Create the "authentication" group with :func:`add_argument_group` and then add each of the authentication-related options to the group, instead of the base parser.
es_ar: Cree el grupo de "autenticación" con :func:`add_argument_group` y luego añada cada una de las opciones relacionadas con la autenticación al grupo, en lugar del analizador base.

source: The program using the group-based parent lists it in the *parents* value, just as before.
es_ar: El programa usando el grupo basado en padres enumera los valores en *padres*, al igual que antes.

source: The help output now shows the authentication options together.
es_ar: Ahora la salida muestra la ayuda de las opciones de autenticación juntos.

source: Mutually Exclusive Options
es_ar: Opciones mutuamente excluyentes

source: Defining mutually exclusive options is a special case of the option grouping feature, and uses :func:`add_mutually_exclusive_group` instead of :func:`add_argument_group`.
es_ar: Definición de opciones mutuamente excluyentes, es un caso especial de la función de la opción de agrupación, y utiliza :func:`add_mutually_exclusive_group` en lugar de :func:` add_argument_group`.

source: :mod:`argparse` enforces the mutal exclusivity for you, so that only one of the options from the group can be given.
es_ar: :mod: `argparse` hace cumplir la exclusividad mutua para usted, por lo que sólo una de las opciones del grupo se pueden dar.

source: Nesting Parsers
es_ar: Analizadores de la jerarquización
