Repository: UniversidadDelEste/pymotw
Catalog: locale/*/LC_MESSAGES/argparse/index.po
Languages: es_ar

source: The parent parser approach described above is one way to share options between related commands. An alternate approach is to combine the commands into a single program, and use subparsers to handle each portion of the command line. The result works in the way ``svn``, ``hg``, and other programs with multiple command line actions, or sub-commands, does.
es_ar: El enfoque parser matriz descrito anteriormente es una forma de compartir las opciones entre comandos relacionados. Un enfoque alternativo es combinar los comandos en un solo programa, y utilizar subparsers para manejar cada parte de la línea de comandos. El resultado funciona de la forma que lo hace ``svn``, `` hg``, y otros programas con múltiples acciones de línea de comandos, o sub-comandos.

source: A program to work with directories on the filesystem might define commands for creating, deleting, and listing the contents of a directory like this:
es_ar: Un programa para trabajar con directorios en el sistema de archivos podría definir comandos para crear, eliminar y listar el contenido de un directorio de la siguiente manera:

source: The help output shows the named subparsers as "commands" that can be specified on the command line as positional arguments.
es_ar: La salida de ayuda muestra los subparsers nombrados como "comandos" que se pueden especificar en la línea de comandos como argumentos posicionales.

source: Each subparser also has its own help, describing the arguments and options for that command.
es_ar: Cada subparser también tiene su propia ayuda, que describe los argumentos y opciones para ese comando.

source: And when the arguments are parsed, the :class:`Namespace` object returned by :func:`parse_args` includes only the values related to the command specified.
es_ar: Y cuando se analizan los argumentos, el objeto :class:`Namespace` devuelto por :func:` parse_args` incluye sólo los valores relacionados con el comando especificado.

source: Advanced Argument Processing
es_ar: Procesamiento de Argumento Avanzado

source: The examples so far have shown simple boolean flags, options with string or numerical arguments, and positional arguments. :mod:`argparse` supports sophisticated argument specification for variable-length argument list, enumerations, and constant values as well.
es_ar: Los ejemplos hasta ahora han mostrado banderas booleanas simples y opciones con cadenas o argumentos numéricos, y los argumentos posicionales. :mod:`argparse` soporta especificación sofisticada de argumentos para longitud variable de lista de argumentos, enumeraciones y valores constantes también.

source: Variable Argument Lists
es_ar: Listas de argumentos variables

source: You can configure a single argument defintion to consume multiple arguments on the command line being parsed. Set *nargs* to one of these flag values, based on the number of required or expected arguments:
es_ar: Puede configurar una única definición argumentos para consumir varios argumentos en la línea de comandos que se analizan. Establecer *nargs * hacia uno de estos valores de la bandera, basado en el número de argumentos requeridos o esperados:

source: Value
es_ar: Valor

source: Meaning
es_ar: Significado

source: The absolute number of arguments (e.g., ``3``).
es_ar: El número absoluto de argumentos (por ejemplo, `` 3``).

source: 0 or 1 arguments
es_ar: Argumentos 0 o 1

source: 0 or all arguments
es_ar: 0 o todos los argumentos

source: All, and at least one, argument
es_ar: Todos, y al menos un argumento

source: The parser enforces the argument count instructions, and generates an accurate syntax diagram as part of the command help text.
es_ar: El analizador hace cumplir las instrucciones de conteo de argumento, y genera un diagrama de sintaxis preciso como parte del texto de ayuda del comando.

source: Argument Types
es_ar: Tipos de argumentos

source: :mod:`argparse` treats all argument values as strings, unless you tell it to convert the string to another type. The *type* parameter to :func:`add_argument` expects a converter function used by the :class:`ArgumentParser` to transform the argument value from a string to some other type.
es_ar: :mod:`argparse` trata todos los valores de los argumentos como cadenas, a menos que usted le indique para convertir la cadena a otro tipo. El parámetro *tipo* :func: `add_argument` espera una función de conversión utilizada por :class:`ArgumentParser` para transformar el valor del argumento de una cadena a algún otro tipo.

source: Any callable that takes a single string argument can be passed as *type*, including built-in types like :func:`int`, :func:`float`, and :func:`file`.
es_ar: Cualquier exigible que toma un solo argumento de cadena se puede pasar como *tipo*, que incluye tipos integrados como :func:`int`, :func:` float` y :func: `File`.

source: If the type conversion fails, :mod:`argparse` raises an exception. :ref:`TypeError <exceptions-TypeError>` and :ref:`ValueError <exceptions-ValueError>` exceptions are trapped automatically and converted to a simple error message for the user. Other exceptions, such as the :ref:`IOError <exceptions-IOError>` in the example below where the input file does not exist, must be handled by the caller.
es_ar: Si la conversión de tipo de falla, mod:`argparse` lanza una excepción. :ref:`TypeError <exceptions-TypeError>` y :ref:`ValueError <exceptions-ValueError>` excepciones son atrapadas de forma automática y se convierten en un mensaje de error simple para el usuario. Otras excepciones, como :ref:`IOError <exceptions-IOError>` en el siguiente ejemplo, donde no existe el archivo de entrada, deben ser manejadas por la persona que llama.

source: To limit an input argument to a value within a pre-defined set, use the *choices* parameter.
es_ar: Para limitar un argumento de entrada a un valor dentro de un conjunto predefinido, utilice parámetros *opciones *.

source: If the argument to ``--mode`` is not one of the allowed values, an error is generated and processing stops.
es_ar: Si el argumento ``--mode`` no es uno de los valores permitidos, se genera un error y el proceso se detiene.

source: File Arguments
es_ar: Argumentos de archivos

source: Although :class:`file` objects can instantiated with a single string argument, that does not allow you to specify the access mode. :class:`FileType` gives you a more flexible way of specifying that an argument should be a file, including the mode and buffer size.
es_ar: Aunque objetos de :class:`File` pueden crear instancias con un único argumento de cadena, que no le permiten especificar el modo de acceso. :class:`FileType` le da una forma más flexible de especificar que un argumento debe ser un archivo, incluyendo el tamaño y el modo de búfer.

source: The value associated with the argument name is the open file handle. You are responsible for closing the file yourself when you are done with it.
es_ar: El valor asociado con el nombre de argumento es el identificador de archivo abierto. Usted es responsable de cerrar el archivo cuando haya terminado con él.

source: Custom Actions
es_ar: Acciones personalizadas

source: In addition to the built-in actions described earlier, you can define custom actions by providing an object that implements the Action API. The object passed to :func:`add_argument` as *action* should take parameters describing the argument being defined (all of the same arguments given to :func:`add_argument`) and return a callable object that takes as parameters the *parser* processing the arguments, the *namespace* holding the parse results, the *value* of the argument being acted on, and the *option_string* that triggered the action.
es_ar: Además de las acciones integradas descritas anteriormente, se pueden definir acciones personalizadas, proporcionando un objeto que implementa la API de Acción. El objeto pasado a :func:`add_argument` como *acción* debería tomar parámetros que describen el argumento que se definen (todos los mismos argumentos dados a :func:`add_argument`) y devuelven un objeto invocable que toma como parámetros el *parser* procesando los argumentos, el *espacio de nombres* sosteniendo los resultados de análisis sintáctico, el *valor* del argumento que se actúa en el *option_string* que desencadenó la acción.

source: A class :class:`Action` is provided as a convenient starting point for defining new actions. The constructor handles the argument definitions, so you only need to override :func:`__call__` in the subclass.
es_ar: Una clase :class:`action` se ofrece como un punto de partida para la definición de nuevas acciones. El constructor se encarga de las definiciones de argumentos, por lo que sólo necesita sobrescribir :func:`__call__` en la subclase.

source: The type of *values* depends on the value of *nargs*. If the argument allows multiple values, *values* will be a list even if it only contains one item.
es_ar: El tipo de *valores* depende del valor de *nargs *. Si el argumento permite múltiples valores, los *valores* serán una lista, incluso si sólo contiene un elemento.

source: The value of *option_string* also depends on the original argument specifiation. For positional, required, arguments, *option_string* is always ``None``.
es_ar: El valor de *option_string* también depende de la especificación original del argumento. Para posicional, se requiere, argumentos, *option_string* siempre es ``None``.

source: The standard library documentation for this module.
es_ar: La documentación de la biblioteca estándar para este módulo.

source: The PyPI page for the version of argparse from outside of the standard libary. This version is compatible with older versions of Python, and can be installed separately.
es_ar: La página PyPI para la versión de argparse desde fuera de la biblioteca estándar. Esta versión es compatible con las versiones anteriores de Python, y se puede instalar por separado.

source: Read and write configuration files.
es_ar: Leer y escribir archivos de configuración.
